app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)
    if @profile.save
---
INSERT INTO "profiles" ("name", "description", "email", "work", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "joij"], ["description", "oijo"], ["email", "iojo"], ["work", "ion"], ["age", 89], ["created_at", "2022-03-31 03:22:36.792342"], ["updated_at", "2022-03-31 03:22:36.792342"]]

  def update
    @profile = Profile.find(params[:id])
    if @profile.update(profile_params)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "profiles" SET "work" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["work", "yesno"], ["updated_at", "2022-03-29 01:23:15.345168"], ["id", 1]]

  def delete
    @profile = Profile.find(params[:id])
    @profile.destroy
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 7]]