app/controllers/publications_controller.rb

  def show
    @publication = Publication.find(params[:id])
    @comments = @publication.comments.all
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @publication = Publication.new(publication_params)
    @publication.user = current_user
    if @publication.save
---
INSERT INTO "publications" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "titulo"], ["content", "contenido"], ["created_at", "2022-03-31 03:22:24.663066"], ["updated_at", "2022-03-31 03:22:24.663066"]]

  def edit
    @publication = Publication.find(params[:id])
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @publication = Publication.find(params[:id])
    if @publication.update(publication_params)
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "publications" SET "title" = $1, "updated_at" = $2 WHERE "publications"."id" = $3  [["title", "turno malo"], ["updated_at", "2022-03-28 18:43:29.817465"], ["id", 1]]

  def delete
    @publication = Publication.find(params[:id])
    @publication.destroy
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "publications" WHERE "publications"."id" = $1  [["id", 1]]